import random
guesses_made = 0

print("Вітаю вас в моєму розважальному чат боті!")
print("Хочу трішки знати про тебе")
name = input("Введіть ваше ім'я")
print("Привіт", name)
age = int(input("Введіть свій вік"))
meny = int(input("""Виберіть цифру що вас цікавить
1. Фільми
2. Музика
3. Ігри
0. Вийти з чат боту"""))

film = {"Комедія": "Джентльмени, Аферистка, Щаслива пора", "Фантастика": "Аватар, Ходячий замок, Людина павук",
        "Жахи": "Воно, 30 Днів ночі, Пустота", "Бойовик": "Червоне поввідомлення, Людина з торонто, Чорна вдова",
        "Мелодрами": "Після, Після весілля, У полоні стихії", "Детектив": "Нічний портьє, Волдо, Ремінісценція"}
while meny != 0:
    if meny == 1:
        film_genre = int(input("""Оберіть цифру із жанром
        1. Комедія ...
        2. Фантастика ...
        3. Жахи ...
        4. Бойовик ...
        5. Мелодрами ...
        6. Детектив
        0. Вийтив попереднє меню"""))
        #
    elif meny == 2:
        music_genre = int(input("""Оберіть цифру із жанром музики
        1. Рок
        2. Поп
        3. Реп
        0. Вийтив в попереднє меню"""))
    elif meny == 3:
        print("ти в грі 'Відгадай число від 0 до 100'")
        print("І так, {0}, я загадав число від 1 до 100. Зможеш відгадати?".format(name))
        number = random.randint(1, 101)
        guess = 0
        while number != guess:
            guesses_made += 1
            guess = int(input("Введи число: "))
            if guess < number:
                print("Твоє число менше того що я загадав")
            if guess > number:
                print("Твоє число більше того що я загадав")
            if number == guess:
                break
        print('Ух ти, {0}! Ти відгадав моє чило, Використавши {1} спрорб!'.format(name, guesses_made))
        print()
        meny = int(input("""Виберіть цифру що вас цікавить
        1. Фільми
        2. Музика
        3. Ігри
        0. Вийти з чат боту"""))

